<template>
    <div>
        <router-link to="/">トップへ</router-link>
        <h1 class="is-size-1">更新履歴</h1>
        <template v-for="(note, index) in releaseNotes">
            <div class="content" :key="index">
                <h2 class="is-size-3">{{note.date}}</h2>
                <ul>
                    <template v-for="(content, index2) in note.contents">
                        <li :key="index2" :style="getStyle(content)">{{content.text}}</li>
                    </template>
                </ul>
            </div>
        </template>
    </div>
</template>

<script>
export default {
  name: 'Release',
  data: function () {
    return {
      releaseNotes: [
        {
          date: '2023年8月14日（月）',
          contents: [
            {text: '朝チケットを付与すると前日になってしまうバグを修正しました。'},
            {text: 'チケット付与時に合計数の表示がおかしくなるバグを修正しました。'},
            {text: 'チケット付与後に他の画面へ移動すると、付与したチケットが残ってしまうバグを修正しました。'}
          ]
        },
        {
          date: '2023年6月23日（金）',
          contents: [
            {text: '使用済みチケットへ移動するボタンを復活しました。'},
            {text: '画面上部のチケット画像の表示非表示切り替えを無くしました。'}
          ]
        },
        {
          date: '2023年6月8日（木）',
          contents: [
            {text: '画面デザインのブラッシュアップを行いました。'},
            {text: '「特別チケットのみ表示」と「使用済みチケットのみ表示」のチェックボックスを追加しました。'},
            {text: 'チケットの画像タップで、画面上部へ戻るように変更しました。'},
            {text: 'ヘッダー部の検索ボタンから日付検索の画面を表示するように変更しました。'}
          ]
        },
        {
          date: '2023年4月27日（木）',
          contents: [
            {text: 'システムの基盤入れ替えを行いました。'},
            {text: 'チケット付与フォームで、その月に特別チケットを付与可能か事前に分かるようになりました。'}
          ]
        },
        {
          date: '2022年5月26日（木）',
          contents: [
            {text: '月に1枚限定の特別チケットを付与できるようになりました。'}
          ]
        },
        {
          date: '2022年4月15日（金）',
          contents: [
            {text: 'チケットの下書き機能を搭載しました。'},
            {text: '一部のチケットの日付が改行されてしまう不具合を修正しました。'}
          ]
        },
        {
          date: '2022年3月25日（金）',
          contents: [
            {text: 'メッセージの改行が表示されるようにしました。'},
            {text: 'メッセージが読みやすいように、デザインを微調整しました。'}
          ]
        },
        {
          date: '2022年3月24日（木）',
          contents: [
            {text: '既読になった時に文字が動くバグを修正しました。'},
            {text: '使用済みタグの表示位置を微調整しました。'}
          ]
        },
        {
          date: '2022年1月23日（日）',
          contents: [
            {text: '既読になる時の表示をわかりやすくしました。'},
            {text: '使用済みチケットに移動する矢印を復活しました。'}
          ]
        },
        {
          date: '2022年1月12日（水）',
          contents: [
            {text: '日付でチケット検索の機能を改善しました。'},
            {text: 'チケットの既読機能を改善しました。大きなチケットも既読にできるようになりました。'}
          ]
        },
        {
          date: '2022年1月10日（月）',
          contents: [
            {text: '日付でチケットを検索する機能を追加しました。'},
            {text: 'ミニチケットをタップすると、検索欄が現れるので、日付を選んでください。'},
            {text: '合わせて、スクロール機能を検索欄の中に移動しました。'}
          ]
        },
        {
          date: '2021年9月19日（日）',
          contents: [
            {text: 'ヘッダーのリンクを使いやすく改善しました。'},
            {text: '今いる画面が、チケットをあげる画面なのか、もらう画面なのかわかりやすくしました。'}
          ]
        },
        {
          date: '2021年7月17日（土）',
          contents: [
            {text: 'チケットが既読になった時、New!!やEdited!!タグを消さずに半透明化するように変更'},
            {text: '使用済みチケットへ移動するボタンの表示方法を変更'}
          ]
        },
        {
          date: '2021年7月17日（土）',
          contents: [
            {text: 'ミニチケットの表示位置の変更（画面左上 → 画面右下）'},
            {text: '使用済みチケットへの表示位置の変更（画面右上 → 画面左下）'},
            {text: 'チケットのメニューボタンの表示位置の変更（画面中央下 → 画面右上）'},
            {text: '「使用済み」タグの表示位置の微調整'},
            {text: 'チケットに未読機能の導入'},
            {text: '初めて見るチケットにはNewのタグを表示します。（もらう側のみ）', style: 'margin-left: 22px;'},
            {text: '編集で内容の変わったチケットにはEditedのタグを表示します。（もらう側のみ）', style: 'margin-left: 22px;'},
            {text: 'チケットを画面に表示して、３秒たつと既読に変わります。', style: 'margin-left: 22px;'}
          ]
        },
        {
          date: '2021年6月13日（日）',
          contents: [
            {text: 'あげたチケットの編集機能'},
            {text: 'あげたチケットの削除機能のデザイン改修'},
            {text: 'チケットをあげる時の日付入力のデザイン改修'},
            {text: 'URLをすっきりさせた'},
            {text: 'ミニチケットを左上から右下に移動'},
            {text: '複数人のリンクを表示できるようにした'},
            {text: 'ヘッダーのデザイン改修'}
          ]
        }
      ]
    }
  },
  methods: {
    getStyle (content) {
      if (content.style !== undefined) return content.style
      return ''
    }
  }
}
</script>
